def @main(%input: Tensor[(1, 3, 128, 128), int8], %v0_weight: Tensor[(16, 3, 3, 3), int8], %v0_bias: Tensor[(16), int32], %v0_zero_x: Tensor[(1), int8], %v0_zero_y: Tensor[(1), int8], %v0_scale: Tensor[(16), float32], %v1_conv_0_weight: Tensor[(16, 1, 3, 3), int8], %v1_conv_0_bias: Tensor[(16), int32], %v1_conv_0_zero_x: Tensor[(1), int8], %v1_conv_0_zero_y: Tensor[(1), int8], %v1_conv_0_scale: Tensor[(16), float32], %v1_conv_1_weight: Tensor[(8, 16, 1, 1), int8], %v1_conv_1_bias: Tensor[(8), int32], %v1_conv_1_zero_x: Tensor[(1), int8], %v1_conv_1_zero_y: Tensor[(1), int8], %v1_conv_1_scale: Tensor[(8), float32], %v2_conv_0_weight: Tensor[(48, 8, 1, 1), int8], %v2_conv_0_bias: Tensor[(48), int32], %v2_conv_0_zero_x: Tensor[(1), int8], %v2_conv_0_zero_y: Tensor[(1), int8], %v2_conv_0_scale: Tensor[(48), float32], %v2_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v2_conv_1_bias: Tensor[(48), int32], %v2_conv_1_zero_x: Tensor[(1), int8], %v2_conv_1_zero_y: Tensor[(1), int8], %v2_conv_1_scale: Tensor[(48), float32], %v2_conv_2_weight: Tensor[(8, 48, 1, 1), int8], %v2_conv_2_bias: Tensor[(8), int32], %v2_conv_2_zero_x: Tensor[(1), int8], %v2_conv_2_zero_y: Tensor[(1), int8], %v2_conv_2_scale: Tensor[(8), float32], %v3_conv_0_weight: Tensor[(48, 8, 1, 1), int8], %v3_conv_0_bias: Tensor[(48), int32], %v3_conv_0_zero_x: Tensor[(1), int8], %v3_conv_0_zero_y: Tensor[(1), int8], %v3_conv_0_scale: Tensor[(48), float32], %v3_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v3_conv_1_bias: Tensor[(48), int32], %v3_conv_1_zero_x: Tensor[(1), int8], %v3_conv_1_zero_y: Tensor[(1), int8], %v3_conv_1_scale: Tensor[(48), float32], %v3_conv_2_weight: Tensor[(8, 48, 1, 1), int8], %v3_conv_2_bias: Tensor[(8), int32], %v3_conv_2_zero_x: Tensor[(1), int8], %v3_conv_2_zero_y: Tensor[(1), int8], %v3_conv_2_scale: Tensor[(8), float32], %v3_qadd_zero_x1: Tensor[(1), int8], %v3_qadd_zero_x2: Tensor[(1), int8], %v3_qadd_scale_x1: Tensor[(1), float32], %v3_qadd_scale_x2: Tensor[(1), float32], %v3_qadd_zero_y: Tensor[(1), int8], %v3_qadd_scale_y: Tensor[(1), float32], %v4_conv_0_weight: Tensor[(48, 8, 1, 1), int8], %v4_conv_0_bias: Tensor[(48), int32], %v4_conv_0_zero_x: Tensor[(1), int8], %v4_conv_0_zero_y: Tensor[(1), int8], %v4_conv_0_scale: Tensor[(48), float32], %v4_conv_1_weight: Tensor[(48, 1, 3, 3), int8], %v4_conv_1_bias: Tensor[(48), int32], %v4_conv_1_zero_x: Tensor[(1), int8], %v4_conv_1_zero_y: Tensor[(1), int8], %v4_conv_1_scale: Tensor[(48), float32], %v4_conv_2_weight: Tensor[(16, 48, 1, 1), int8], %v4_conv_2_bias: Tensor[(16), int32], %v4_conv_2_zero_x: Tensor[(1), int8], %v4_conv_2_zero_y: Tensor[(1), int8], %v4_conv_2_scale: Tensor[(16), float32], %v5_conv_0_weight: Tensor[(96, 16, 1, 1), int8], %v5_conv_0_bias: Tensor[(96), int32], %v5_conv_0_zero_x: Tensor[(1), int8], %v5_conv_0_zero_y: Tensor[(1), int8], %v5_conv_0_scale: Tensor[(96), float32], %v5_conv_1_weight: Tensor[(96, 1, 3, 3), int8], %v5_conv_1_bias: Tensor[(96), int32], %v5_conv_1_zero_x: Tensor[(1), int8], %v5_conv_1_zero_y: Tensor[(1), int8], %v5_conv_1_scale: Tensor[(96), float32], %v5_conv_2_weight: Tensor[(16, 96, 1, 1), int8], %v5_conv_2_bias: Tensor[(16), int32], %v5_conv_2_zero_x: Tensor[(1), int8], %v5_conv_2_zero_y: Tensor[(1), int8], %v5_conv_2_scale: Tensor[(16), float32], %v5_qadd_zero_x1: Tensor[(1), int8], %v5_qadd_zero_x2: Tensor[(1), int8], %v5_qadd_scale_x1: Tensor[(1), float32], %v5_qadd_scale_x2: Tensor[(1), float32], %v5_qadd_zero_y: Tensor[(1), int8], %v5_qadd_scale_y: Tensor[(1), float32], %v6_conv_0_weight: Tensor[(96, 16, 1, 1), int8], %v6_conv_0_bias: Tensor[(96), int32], %v6_conv_0_zero_x: Tensor[(1), int8], %v6_conv_0_zero_y: Tensor[(1), int8], %v6_conv_0_scale: Tensor[(96), float32], %v6_conv_1_weight: Tensor[(96, 1, 3, 3), int8], %v6_conv_1_bias: Tensor[(96), int32], %v6_conv_1_zero_x: Tensor[(1), int8], %v6_conv_1_zero_y: Tensor[(1), int8], %v6_conv_1_scale: Tensor[(96), float32], %v6_conv_2_weight: Tensor[(16, 96, 1, 1), int8], %v6_conv_2_bias: Tensor[(16), int32], %v6_conv_2_zero_x: Tensor[(1), int8], %v6_conv_2_zero_y: Tensor[(1), int8], %v6_conv_2_scale: Tensor[(16), float32], %v6_qadd_zero_x1: Tensor[(1), int8], %v6_qadd_zero_x2: Tensor[(1), int8], %v6_qadd_scale_x1: Tensor[(1), float32], %v6_qadd_scale_x2: Tensor[(1), float32], %v6_qadd_zero_y: Tensor[(1), int8], %v6_qadd_scale_y: Tensor[(1), float32], %v7_conv_0_weight: Tensor[(96, 16, 1, 1), int8], %v7_conv_0_bias: Tensor[(96), int32], %v7_conv_0_zero_x: Tensor[(1), int8], %v7_conv_0_zero_y: Tensor[(1), int8], %v7_conv_0_scale: Tensor[(96), float32], %v7_conv_1_weight: Tensor[(96, 1, 3, 3), int8], %v7_conv_1_bias: Tensor[(96), int32], %v7_conv_1_zero_x: Tensor[(1), int8], %v7_conv_1_zero_y: Tensor[(1), int8], %v7_conv_1_scale: Tensor[(96), float32], %v7_conv_2_weight: Tensor[(24, 96, 1, 1), int8], %v7_conv_2_bias: Tensor[(24), int32], %v7_conv_2_zero_x: Tensor[(1), int8], %v7_conv_2_zero_y: Tensor[(1), int8], %v7_conv_2_scale: Tensor[(24), float32], %v8_conv_0_weight: Tensor[(144, 24, 1, 1), int8], %v8_conv_0_bias: Tensor[(144), int32], %v8_conv_0_zero_x: Tensor[(1), int8], %v8_conv_0_zero_y: Tensor[(1), int8], %v8_conv_0_scale: Tensor[(144), float32], %v8_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v8_conv_1_bias: Tensor[(144), int32], %v8_conv_1_zero_x: Tensor[(1), int8], %v8_conv_1_zero_y: Tensor[(1), int8], %v8_conv_1_scale: Tensor[(144), float32], %v8_conv_2_weight: Tensor[(24, 144, 1, 1), int8], %v8_conv_2_bias: Tensor[(24), int32], %v8_conv_2_zero_x: Tensor[(1), int8], %v8_conv_2_zero_y: Tensor[(1), int8], %v8_conv_2_scale: Tensor[(24), float32], %v8_qadd_zero_x1: Tensor[(1), int8], %v8_qadd_zero_x2: Tensor[(1), int8], %v8_qadd_scale_x1: Tensor[(1), float32], %v8_qadd_scale_x2: Tensor[(1), float32], %v8_qadd_zero_y: Tensor[(1), int8], %v8_qadd_scale_y: Tensor[(1), float32], %v9_conv_0_weight: Tensor[(144, 24, 1, 1), int8], %v9_conv_0_bias: Tensor[(144), int32], %v9_conv_0_zero_x: Tensor[(1), int8], %v9_conv_0_zero_y: Tensor[(1), int8], %v9_conv_0_scale: Tensor[(144), float32], %v9_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v9_conv_1_bias: Tensor[(144), int32], %v9_conv_1_zero_x: Tensor[(1), int8], %v9_conv_1_zero_y: Tensor[(1), int8], %v9_conv_1_scale: Tensor[(144), float32], %v9_conv_2_weight: Tensor[(24, 144, 1, 1), int8], %v9_conv_2_bias: Tensor[(24), int32], %v9_conv_2_zero_x: Tensor[(1), int8], %v9_conv_2_zero_y: Tensor[(1), int8], %v9_conv_2_scale: Tensor[(24), float32], %v9_qadd_zero_x1: Tensor[(1), int8], %v9_qadd_zero_x2: Tensor[(1), int8], %v9_qadd_scale_x1: Tensor[(1), float32], %v9_qadd_scale_x2: Tensor[(1), float32], %v9_qadd_zero_y: Tensor[(1), int8], %v9_qadd_scale_y: Tensor[(1), float32], %v10_conv_0_weight: Tensor[(144, 24, 1, 1), int8], %v10_conv_0_bias: Tensor[(144), int32], %v10_conv_0_zero_x: Tensor[(1), int8], %v10_conv_0_zero_y: Tensor[(1), int8], %v10_conv_0_scale: Tensor[(144), float32], %v10_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v10_conv_1_bias: Tensor[(144), int32], %v10_conv_1_zero_x: Tensor[(1), int8], %v10_conv_1_zero_y: Tensor[(1), int8], %v10_conv_1_scale: Tensor[(144), float32], %v10_conv_2_weight: Tensor[(24, 144, 1, 1), int8], %v10_conv_2_bias: Tensor[(24), int32], %v10_conv_2_zero_x: Tensor[(1), int8], %v10_conv_2_zero_y: Tensor[(1), int8], %v10_conv_2_scale: Tensor[(24), float32], %v10_qadd_zero_x1: Tensor[(1), int8], %v10_qadd_zero_x2: Tensor[(1), int8], %v10_qadd_scale_x1: Tensor[(1), float32], %v10_qadd_scale_x2: Tensor[(1), float32], %v10_qadd_zero_y: Tensor[(1), int8], %v10_qadd_scale_y: Tensor[(1), float32], %v11_conv_0_weight: Tensor[(144, 24, 1, 1), int8], %v11_conv_0_bias: Tensor[(144), int32], %v11_conv_0_zero_x: Tensor[(1), int8], %v11_conv_0_zero_y: Tensor[(1), int8], %v11_conv_0_scale: Tensor[(144), float32], %v11_conv_1_weight: Tensor[(144, 1, 3, 3), int8], %v11_conv_1_bias: Tensor[(144), int32], %v11_conv_1_zero_x: Tensor[(1), int8], %v11_conv_1_zero_y: Tensor[(1), int8], %v11_conv_1_scale: Tensor[(144), float32], %v11_conv_2_weight: Tensor[(32, 144, 1, 1), int8], %v11_conv_2_bias: Tensor[(32), int32], %v11_conv_2_zero_x: Tensor[(1), int8], %v11_conv_2_zero_y: Tensor[(1), int8], %v11_conv_2_scale: Tensor[(32), float32], %v12_conv_0_weight: Tensor[(192, 32, 1, 1), int8], %v12_conv_0_bias: Tensor[(192), int32], %v12_conv_0_zero_x: Tensor[(1), int8], %v12_conv_0_zero_y: Tensor[(1), int8], %v12_conv_0_scale: Tensor[(192), float32], %v12_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v12_conv_1_bias: Tensor[(192), int32], %v12_conv_1_zero_x: Tensor[(1), int8], %v12_conv_1_zero_y: Tensor[(1), int8], %v12_conv_1_scale: Tensor[(192), float32], %v12_conv_2_weight: Tensor[(32, 192, 1, 1), int8], %v12_conv_2_bias: Tensor[(32), int32], %v12_conv_2_zero_x: Tensor[(1), int8], %v12_conv_2_zero_y: Tensor[(1), int8], %v12_conv_2_scale: Tensor[(32), float32], %v12_qadd_zero_x1: Tensor[(1), int8], %v12_qadd_zero_x2: Tensor[(1), int8], %v12_qadd_scale_x1: Tensor[(1), float32], %v12_qadd_scale_x2: Tensor[(1), float32], %v12_qadd_zero_y: Tensor[(1), int8], %v12_qadd_scale_y: Tensor[(1), float32], %v13_conv_0_weight: Tensor[(192, 32, 1, 1), int8], %v13_conv_0_bias: Tensor[(192), int32], %v13_conv_0_zero_x: Tensor[(1), int8], %v13_conv_0_zero_y: Tensor[(1), int8], %v13_conv_0_scale: Tensor[(192), float32], %v13_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v13_conv_1_bias: Tensor[(192), int32], %v13_conv_1_zero_x: Tensor[(1), int8], %v13_conv_1_zero_y: Tensor[(1), int8], %v13_conv_1_scale: Tensor[(192), float32], %v13_conv_2_weight: Tensor[(32, 192, 1, 1), int8], %v13_conv_2_bias: Tensor[(32), int32], %v13_conv_2_zero_x: Tensor[(1), int8], %v13_conv_2_zero_y: Tensor[(1), int8], %v13_conv_2_scale: Tensor[(32), float32], %v13_qadd_zero_x1: Tensor[(1), int8], %v13_qadd_zero_x2: Tensor[(1), int8], %v13_qadd_scale_x1: Tensor[(1), float32], %v13_qadd_scale_x2: Tensor[(1), float32], %v13_qadd_zero_y: Tensor[(1), int8], %v13_qadd_scale_y: Tensor[(1), float32], %v14_conv_0_weight: Tensor[(192, 32, 1, 1), int8], %v14_conv_0_bias: Tensor[(192), int32], %v14_conv_0_zero_x: Tensor[(1), int8], %v14_conv_0_zero_y: Tensor[(1), int8], %v14_conv_0_scale: Tensor[(192), float32], %v14_conv_1_weight: Tensor[(192, 1, 3, 3), int8], %v14_conv_1_bias: Tensor[(192), int32], %v14_conv_1_zero_x: Tensor[(1), int8], %v14_conv_1_zero_y: Tensor[(1), int8], %v14_conv_1_scale: Tensor[(192), float32], %v14_conv_2_weight: Tensor[(56, 192, 1, 1), int8], %v14_conv_2_bias: Tensor[(56), int32], %v14_conv_2_zero_x: Tensor[(1), int8], %v14_conv_2_zero_y: Tensor[(1), int8], %v14_conv_2_scale: Tensor[(56), float32], %v15_conv_0_weight: Tensor[(336, 56, 1, 1), int8], %v15_conv_0_bias: Tensor[(336), int32], %v15_conv_0_zero_x: Tensor[(1), int8], %v15_conv_0_zero_y: Tensor[(1), int8], %v15_conv_0_scale: Tensor[(336), float32], %v15_conv_1_weight: Tensor[(336, 1, 3, 3), int8], %v15_conv_1_bias: Tensor[(336), int32], %v15_conv_1_zero_x: Tensor[(1), int8], %v15_conv_1_zero_y: Tensor[(1), int8], %v15_conv_1_scale: Tensor[(336), float32], %v15_conv_2_weight: Tensor[(56, 336, 1, 1), int8], %v15_conv_2_bias: Tensor[(56), int32], %v15_conv_2_zero_x: Tensor[(1), int8], %v15_conv_2_zero_y: Tensor[(1), int8], %v15_conv_2_scale: Tensor[(56), float32], %v15_qadd_zero_x1: Tensor[(1), int8], %v15_qadd_zero_x2: Tensor[(1), int8], %v15_qadd_scale_x1: Tensor[(1), float32], %v15_qadd_scale_x2: Tensor[(1), float32], %v15_qadd_zero_y: Tensor[(1), int8], %v15_qadd_scale_y: Tensor[(1), float32], %v16_conv_0_weight: Tensor[(336, 56, 1, 1), int8], %v16_conv_0_bias: Tensor[(336), int32], %v16_conv_0_zero_x: Tensor[(1), int8], %v16_conv_0_zero_y: Tensor[(1), int8], %v16_conv_0_scale: Tensor[(336), float32], %v16_conv_1_weight: Tensor[(336, 1, 3, 3), int8], %v16_conv_1_bias: Tensor[(336), int32], %v16_conv_1_zero_x: Tensor[(1), int8], %v16_conv_1_zero_y: Tensor[(1), int8], %v16_conv_1_scale: Tensor[(336), float32], %v16_conv_2_weight: Tensor[(56, 336, 1, 1), int8], %v16_conv_2_bias: Tensor[(56), int32], %v16_conv_2_zero_x: Tensor[(1), int8], %v16_conv_2_zero_y: Tensor[(1), int8], %v16_conv_2_scale: Tensor[(56), float32], %v16_qadd_zero_x1: Tensor[(1), int8], %v16_qadd_zero_x2: Tensor[(1), int8], %v16_qadd_scale_x1: Tensor[(1), float32], %v16_qadd_scale_x2: Tensor[(1), float32], %v16_qadd_zero_y: Tensor[(1), int8], %v16_qadd_scale_y: Tensor[(1), float32], %v17_conv_0_weight: Tensor[(336, 56, 1, 1), int8], %v17_conv_0_bias: Tensor[(336), int32], %v17_conv_0_zero_x: Tensor[(1), int8], %v17_conv_0_zero_y: Tensor[(1), int8], %v17_conv_0_scale: Tensor[(336), float32], %v17_conv_1_weight: Tensor[(336, 1, 3, 3), int8], %v17_conv_1_bias: Tensor[(336), int32], %v17_conv_1_zero_x: Tensor[(1), int8], %v17_conv_1_zero_y: Tensor[(1), int8], %v17_conv_1_scale: Tensor[(336), float32], %v17_conv_2_weight: Tensor[(112, 336, 1, 1), int8], %v17_conv_2_bias: Tensor[(112), int32], %v17_conv_2_zero_x: Tensor[(1), int8], %v17_conv_2_zero_y: Tensor[(1), int8], %v17_conv_2_scale: Tensor[(112), float32], %v18_weight: Tensor[(10, 112, 1, 1), int8], %v18_bias: Tensor[(10), int32], %v18_zero_x: Tensor[(1), int8], %v18_zero_y: Tensor[(1), int8], %v18_scale: Tensor[(10), float32], %label: Tensor[(1, 10), float32]) -> (float32, Tensor[(10), float32], Tensor[(10, 112, 1, 1), float32], Tensor[(112), float32], Tensor[(112, 336, 1, 1), float32], Tensor[(336), float32], Tensor[(336, 1, 3, 3), float32], Tensor[(336), float32], Tensor[(336, 56, 1, 1), float32], Tensor[(56), float32], Tensor[(56, 336, 1, 1), float32], Tensor[(336), float32], Tensor[(336, 1, 3, 3), float32], Tensor[(336), float32], Tensor[(336, 56, 1, 1), float32], Tensor[(56), float32], Tensor[(56, 336, 1, 1), float32], Tensor[(336), float32], Tensor[(336, 1, 3, 3), float32], Tensor[(336), float32], Tensor[(336, 56, 1, 1), float32], Tensor[(56), float32], Tensor[(56, 192, 1, 1), float32], Tensor[(192), float32], Tensor[(192, 1, 3, 3), float32], Tensor[(192), float32], Tensor[(192, 32, 1, 1), float32], Tensor[(32), float32], Tensor[(32, 192, 1, 1), float32], Tensor[(192), float32], Tensor[(192, 1, 3, 3), float32], Tensor[(192), float32], Tensor[(192, 32, 1, 1), float32], Tensor[(32), float32], Tensor[(32, 192, 1, 1), float32], Tensor[(192), float32], Tensor[(192, 1, 3, 3), float32], Tensor[(192), float32], Tensor[(192, 32, 1, 1), float32], Tensor[(32), float32], Tensor[(32, 144, 1, 1), float32], Tensor[(144), float32], Tensor[(144, 1, 3, 3), float32], Tensor[(144), float32], Tensor[(144, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 144, 1, 1), float32], Tensor[(144), float32], Tensor[(144, 1, 3, 3), float32], Tensor[(144), float32], Tensor[(144, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 144, 1, 1), float32], Tensor[(144), float32], Tensor[(144, 1, 3, 3), float32], Tensor[(144), float32], Tensor[(144, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 144, 1, 1), float32], Tensor[(144), float32], Tensor[(144, 1, 3, 3), float32], Tensor[(144), float32], Tensor[(144, 24, 1, 1), float32], Tensor[(24), float32], Tensor[(24, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 1, 3, 3), float32], Tensor[(96), float32], Tensor[(96, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 1, 3, 3), float32], Tensor[(96), float32], Tensor[(96, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 96, 1, 1), float32], Tensor[(96), float32], Tensor[(96, 1, 3, 3), float32], Tensor[(96), float32], Tensor[(96, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 1, 3, 3), float32], Tensor[(48), float32], Tensor[(48, 8, 1, 1), float32], Tensor[(8), float32], Tensor[(8, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 1, 3, 3), float32], Tensor[(48), float32], Tensor[(48, 8, 1, 1), float32], Tensor[(8), float32], Tensor[(8, 48, 1, 1), float32], Tensor[(48), float32], Tensor[(48, 1, 3, 3), float32], Tensor[(48), float32], Tensor[(48, 8, 1, 1), float32], Tensor[(8), float32], Tensor[(8, 16, 1, 1), float32], Tensor[(16), float32], Tensor[(16, 1, 3, 3), float32], Tensor[(16), float32], Tensor[(16, 3, 3, 3), float32]) {
  %0 = nn.mcuconv2d(%input, %v0_weight, %v0_bias, %v0_zero_x, %v0_zero_y, %v0_scale, strides=[2, 2], padding=[1, 1, 1, 1]) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %1 = nn.mcutruncate(%0) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %2 = nn.mcuconv2d(%1, %v1_conv_0_weight, %v1_conv_0_bias, %v1_conv_0_zero_x, %v1_conv_0_zero_y, %v1_conv_0_scale, padding=[1, 1, 1, 1], groups=16) /* ty=Tensor[(1, 16, 64, 64), int32] */;
  %3 = nn.mcutruncate(%2) /* ty=Tensor[(1, 16, 64, 64), int8] */;
  %4 = nn.mcuconv2d(%3, %v1_conv_1_weight, %v1_conv_1_bias, %v1_conv_1_zero_x, %v1_conv_1_zero_y, %v1_conv_1_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 64, 64), int32] */;
  %5 = nn.mcutruncate(%4) /* ty=Tensor[(1, 8, 64, 64), int8] */;
  %6 = nn.mcuconv2d(%5, %v2_conv_0_weight, %v2_conv_0_bias, %v2_conv_0_zero_x, %v2_conv_0_zero_y, %v2_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 64, 64), int32] */;
  %7 = nn.mcutruncate(%6) /* ty=Tensor[(1, 48, 64, 64), int8] */;
  %8 = nn.mcuconv2d(%7, %v2_conv_1_weight, %v2_conv_1_bias, %v2_conv_1_zero_x, %v2_conv_1_zero_y, %v2_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %9 = nn.mcutruncate(%8) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %10 = nn.mcuconv2d(%9, %v2_conv_2_weight, %v2_conv_2_bias, %v2_conv_2_zero_x, %v2_conv_2_zero_y, %v2_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 32, 32), int32] */;
  %11 = nn.mcutruncate(%10) /* ty=Tensor[(1, 8, 32, 32), int8] */;
  %12 = nn.mcuconv2d(%11, %v3_conv_0_weight, %v3_conv_0_bias, %v3_conv_0_zero_x, %v3_conv_0_zero_y, %v3_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %13 = nn.mcutruncate(%12) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %14 = nn.mcuconv2d(%13, %v3_conv_1_weight, %v3_conv_1_bias, %v3_conv_1_zero_x, %v3_conv_1_zero_y, %v3_conv_1_scale, padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %15 = nn.mcutruncate(%14) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %16 = nn.mcuconv2d(%15, %v3_conv_2_weight, %v3_conv_2_bias, %v3_conv_2_zero_x, %v3_conv_2_zero_y, %v3_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 8, 32, 32), int32] */;
  %17 = nn.mcutruncate(%16) /* ty=Tensor[(1, 8, 32, 32), int8] */;
  %18 = nn.mcuadd(%11, %17, %v3_qadd_zero_x1, %v3_qadd_zero_x2, %v3_qadd_scale_x1, %v3_qadd_scale_x2, %v3_qadd_zero_y, %v3_qadd_scale_y, axis=0) /* ty=Tensor[(1, 8, 32, 32), int8] */;
  %19 = nn.mcutruncate(%18) /* ty=Tensor[(1, 8, 32, 32), int8] */;
  %20 = nn.mcuconv2d(%19, %v4_conv_0_weight, %v4_conv_0_bias, %v4_conv_0_zero_x, %v4_conv_0_zero_y, %v4_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 48, 32, 32), int32] */;
  %21 = nn.mcutruncate(%20) /* ty=Tensor[(1, 48, 32, 32), int8] */;
  %22 = nn.mcuconv2d(%21, %v4_conv_1_weight, %v4_conv_1_bias, %v4_conv_1_zero_x, %v4_conv_1_zero_y, %v4_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=48) /* ty=Tensor[(1, 48, 16, 16), int32] */;
  %23 = nn.mcutruncate(%22) /* ty=Tensor[(1, 48, 16, 16), int8] */;
  %24 = nn.mcuconv2d(%23, %v4_conv_2_weight, %v4_conv_2_bias, %v4_conv_2_zero_x, %v4_conv_2_zero_y, %v4_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 16, 16), int32] */;
  %25 = nn.mcutruncate(%24) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %26 = nn.mcuconv2d(%25, %v5_conv_0_weight, %v5_conv_0_bias, %v5_conv_0_zero_x, %v5_conv_0_zero_y, %v5_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 16, 16), int32] */;
  %27 = nn.mcutruncate(%26) /* ty=Tensor[(1, 96, 16, 16), int8] */;
  %28 = nn.mcuconv2d(%27, %v5_conv_1_weight, %v5_conv_1_bias, %v5_conv_1_zero_x, %v5_conv_1_zero_y, %v5_conv_1_scale, padding=[1, 1, 1, 1], groups=96) /* ty=Tensor[(1, 96, 16, 16), int32] */;
  %29 = nn.mcutruncate(%28) /* ty=Tensor[(1, 96, 16, 16), int8] */;
  %30 = nn.mcuconv2d(%29, %v5_conv_2_weight, %v5_conv_2_bias, %v5_conv_2_zero_x, %v5_conv_2_zero_y, %v5_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 16, 16), int32] */;
  %31 = nn.mcutruncate(%30) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %32 = nn.mcuadd(%25, %31, %v5_qadd_zero_x1, %v5_qadd_zero_x2, %v5_qadd_scale_x1, %v5_qadd_scale_x2, %v5_qadd_zero_y, %v5_qadd_scale_y, axis=0) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %33 = nn.mcutruncate(%32) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %34 = nn.mcuconv2d(%33, %v6_conv_0_weight, %v6_conv_0_bias, %v6_conv_0_zero_x, %v6_conv_0_zero_y, %v6_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 16, 16), int32] */;
  %35 = nn.mcutruncate(%34) /* ty=Tensor[(1, 96, 16, 16), int8] */;
  %36 = nn.mcuconv2d(%35, %v6_conv_1_weight, %v6_conv_1_bias, %v6_conv_1_zero_x, %v6_conv_1_zero_y, %v6_conv_1_scale, padding=[1, 1, 1, 1], groups=96) /* ty=Tensor[(1, 96, 16, 16), int32] */;
  %37 = nn.mcutruncate(%36) /* ty=Tensor[(1, 96, 16, 16), int8] */;
  %38 = nn.mcuconv2d(%37, %v6_conv_2_weight, %v6_conv_2_bias, %v6_conv_2_zero_x, %v6_conv_2_zero_y, %v6_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 16, 16, 16), int32] */;
  %39 = nn.mcutruncate(%38) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %40 = nn.mcuadd(%33, %39, %v6_qadd_zero_x1, %v6_qadd_zero_x2, %v6_qadd_scale_x1, %v6_qadd_scale_x2, %v6_qadd_zero_y, %v6_qadd_scale_y, axis=0) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %41 = nn.mcutruncate(%40) /* ty=Tensor[(1, 16, 16, 16), int8] */;
  %42 = nn.mcuconv2d(%41, %v7_conv_0_weight, %v7_conv_0_bias, %v7_conv_0_zero_x, %v7_conv_0_zero_y, %v7_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 96, 16, 16), int32] */;
  %43 = nn.mcutruncate(%42) /* ty=Tensor[(1, 96, 16, 16), int8] */;
  %44 = nn.mcuconv2d(%43, %v7_conv_1_weight, %v7_conv_1_bias, %v7_conv_1_zero_x, %v7_conv_1_zero_y, %v7_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=96) /* ty=Tensor[(1, 96, 8, 8), int32] */;
  %45 = nn.mcutruncate(%44) /* ty=Tensor[(1, 96, 8, 8), int8] */;
  %46 = nn.mcuconv2d(%45, %v7_conv_2_weight, %v7_conv_2_bias, %v7_conv_2_zero_x, %v7_conv_2_zero_y, %v7_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 8, 8), int32] */;
  %47 = nn.mcutruncate(%46) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %48 = nn.mcuconv2d(%47, %v8_conv_0_weight, %v8_conv_0_bias, %v8_conv_0_zero_x, %v8_conv_0_zero_y, %v8_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %49 = nn.mcutruncate(%48) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %50 = nn.mcuconv2d(%49, %v8_conv_1_weight, %v8_conv_1_bias, %v8_conv_1_zero_x, %v8_conv_1_zero_y, %v8_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %51 = nn.mcutruncate(%50) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %52 = nn.mcuconv2d(%51, %v8_conv_2_weight, %v8_conv_2_bias, %v8_conv_2_zero_x, %v8_conv_2_zero_y, %v8_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 8, 8), int32] */;
  %53 = nn.mcutruncate(%52) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %54 = nn.mcuadd(%47, %53, %v8_qadd_zero_x1, %v8_qadd_zero_x2, %v8_qadd_scale_x1, %v8_qadd_scale_x2, %v8_qadd_zero_y, %v8_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %55 = nn.mcutruncate(%54) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %56 = nn.mcuconv2d(%55, %v9_conv_0_weight, %v9_conv_0_bias, %v9_conv_0_zero_x, %v9_conv_0_zero_y, %v9_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %57 = nn.mcutruncate(%56) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %58 = nn.mcuconv2d(%57, %v9_conv_1_weight, %v9_conv_1_bias, %v9_conv_1_zero_x, %v9_conv_1_zero_y, %v9_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %59 = nn.mcutruncate(%58) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %60 = nn.mcuconv2d(%59, %v9_conv_2_weight, %v9_conv_2_bias, %v9_conv_2_zero_x, %v9_conv_2_zero_y, %v9_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 8, 8), int32] */;
  %61 = nn.mcutruncate(%60) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %62 = nn.mcuadd(%55, %61, %v9_qadd_zero_x1, %v9_qadd_zero_x2, %v9_qadd_scale_x1, %v9_qadd_scale_x2, %v9_qadd_zero_y, %v9_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %63 = nn.mcutruncate(%62) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %64 = nn.mcuconv2d(%63, %v10_conv_0_weight, %v10_conv_0_bias, %v10_conv_0_zero_x, %v10_conv_0_zero_y, %v10_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %65 = nn.mcutruncate(%64) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %66 = nn.mcuconv2d(%65, %v10_conv_1_weight, %v10_conv_1_bias, %v10_conv_1_zero_x, %v10_conv_1_zero_y, %v10_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %67 = nn.mcutruncate(%66) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %68 = nn.mcuconv2d(%67, %v10_conv_2_weight, %v10_conv_2_bias, %v10_conv_2_zero_x, %v10_conv_2_zero_y, %v10_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 24, 8, 8), int32] */;
  %69 = nn.mcutruncate(%68) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %70 = nn.mcuadd(%63, %69, %v10_qadd_zero_x1, %v10_qadd_zero_x2, %v10_qadd_scale_x1, %v10_qadd_scale_x2, %v10_qadd_zero_y, %v10_qadd_scale_y, axis=0) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %71 = nn.mcutruncate(%70) /* ty=Tensor[(1, 24, 8, 8), int8] */;
  %72 = nn.mcuconv2d(%71, %v11_conv_0_weight, %v11_conv_0_bias, %v11_conv_0_zero_x, %v11_conv_0_zero_y, %v11_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %73 = nn.mcutruncate(%72) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %74 = nn.mcuconv2d(%73, %v11_conv_1_weight, %v11_conv_1_bias, %v11_conv_1_zero_x, %v11_conv_1_zero_y, %v11_conv_1_scale, padding=[1, 1, 1, 1], groups=144) /* ty=Tensor[(1, 144, 8, 8), int32] */;
  %75 = nn.mcutruncate(%74) /* ty=Tensor[(1, 144, 8, 8), int8] */;
  %76 = nn.mcuconv2d(%75, %v11_conv_2_weight, %v11_conv_2_bias, %v11_conv_2_zero_x, %v11_conv_2_zero_y, %v11_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 8, 8), int32] */;
  %77 = nn.mcutruncate(%76) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %78 = nn.mcuconv2d(%77, %v12_conv_0_weight, %v12_conv_0_bias, %v12_conv_0_zero_x, %v12_conv_0_zero_y, %v12_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %79 = nn.mcutruncate(%78) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %80 = nn.mcuconv2d(%79, %v12_conv_1_weight, %v12_conv_1_bias, %v12_conv_1_zero_x, %v12_conv_1_zero_y, %v12_conv_1_scale, padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %81 = nn.mcutruncate(%80) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %82 = nn.mcuconv2d(%81, %v12_conv_2_weight, %v12_conv_2_bias, %v12_conv_2_zero_x, %v12_conv_2_zero_y, %v12_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 8, 8), int32] */;
  %83 = nn.mcutruncate(%82) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %84 = nn.mcuadd(%77, %83, %v12_qadd_zero_x1, %v12_qadd_zero_x2, %v12_qadd_scale_x1, %v12_qadd_scale_x2, %v12_qadd_zero_y, %v12_qadd_scale_y, axis=0) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %85 = nn.mcutruncate(%84) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %86 = nn.mcuconv2d(%85, %v13_conv_0_weight, %v13_conv_0_bias, %v13_conv_0_zero_x, %v13_conv_0_zero_y, %v13_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %87 = nn.mcutruncate(%86) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %88 = nn.mcuconv2d(%87, %v13_conv_1_weight, %v13_conv_1_bias, %v13_conv_1_zero_x, %v13_conv_1_zero_y, %v13_conv_1_scale, padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %89 = nn.mcutruncate(%88) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %90 = nn.mcuconv2d(%89, %v13_conv_2_weight, %v13_conv_2_bias, %v13_conv_2_zero_x, %v13_conv_2_zero_y, %v13_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 32, 8, 8), int32] */;
  %91 = nn.mcutruncate(%90) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %92 = nn.mcuadd(%85, %91, %v13_qadd_zero_x1, %v13_qadd_zero_x2, %v13_qadd_scale_x1, %v13_qadd_scale_x2, %v13_qadd_zero_y, %v13_qadd_scale_y, axis=0) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %93 = nn.mcutruncate(%92) /* ty=Tensor[(1, 32, 8, 8), int8] */;
  %94 = nn.mcuconv2d(%93, %v14_conv_0_weight, %v14_conv_0_bias, %v14_conv_0_zero_x, %v14_conv_0_zero_y, %v14_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 192, 8, 8), int32] */;
  %95 = nn.mcutruncate(%94) /* ty=Tensor[(1, 192, 8, 8), int8] */;
  %96 = nn.mcuconv2d(%95, %v14_conv_1_weight, %v14_conv_1_bias, %v14_conv_1_zero_x, %v14_conv_1_zero_y, %v14_conv_1_scale, strides=[2, 2], padding=[1, 1, 1, 1], groups=192) /* ty=Tensor[(1, 192, 4, 4), int32] */;
  %97 = nn.mcutruncate(%96) /* ty=Tensor[(1, 192, 4, 4), int8] */;
  %98 = nn.mcuconv2d(%97, %v14_conv_2_weight, %v14_conv_2_bias, %v14_conv_2_zero_x, %v14_conv_2_zero_y, %v14_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), int32] */;
  %99 = nn.mcutruncate(%98) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %100 = nn.mcuconv2d(%99, %v15_conv_0_weight, %v15_conv_0_bias, %v15_conv_0_zero_x, %v15_conv_0_zero_y, %v15_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %101 = nn.mcutruncate(%100) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %102 = nn.mcuconv2d(%101, %v15_conv_1_weight, %v15_conv_1_bias, %v15_conv_1_zero_x, %v15_conv_1_zero_y, %v15_conv_1_scale, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %103 = nn.mcutruncate(%102) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %104 = nn.mcuconv2d(%103, %v15_conv_2_weight, %v15_conv_2_bias, %v15_conv_2_zero_x, %v15_conv_2_zero_y, %v15_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), int32] */;
  %105 = nn.mcutruncate(%104) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %106 = nn.mcuadd(%99, %105, %v15_qadd_zero_x1, %v15_qadd_zero_x2, %v15_qadd_scale_x1, %v15_qadd_scale_x2, %v15_qadd_zero_y, %v15_qadd_scale_y, axis=0) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %107 = nn.mcutruncate(%106) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %108 = nn.mcuconv2d(%107, %v16_conv_0_weight, %v16_conv_0_bias, %v16_conv_0_zero_x, %v16_conv_0_zero_y, %v16_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %109 = nn.mcutruncate(%108) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %110 = nn.mcuconv2d(%109, %v16_conv_1_weight, %v16_conv_1_bias, %v16_conv_1_zero_x, %v16_conv_1_zero_y, %v16_conv_1_scale, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %111 = nn.mcutruncate(%110) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %112 = nn.mcuconv2d(%111, %v16_conv_2_weight, %v16_conv_2_bias, %v16_conv_2_zero_x, %v16_conv_2_zero_y, %v16_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), int32] */;
  %113 = nn.mcutruncate(%112) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %114 = nn.mcuadd(%107, %113, %v16_qadd_zero_x1, %v16_qadd_zero_x2, %v16_qadd_scale_x1, %v16_qadd_scale_x2, %v16_qadd_zero_y, %v16_qadd_scale_y, axis=0) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %115 = nn.mcutruncate(%114) /* ty=Tensor[(1, 56, 4, 4), int8] */;
  %116 = nn.mcuconv2d(%115, %v17_conv_0_weight, %v17_conv_0_bias, %v17_conv_0_zero_x, %v17_conv_0_zero_y, %v17_conv_0_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %117 = nn.mcutruncate(%116) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %118 = nn.mcuconv2d(%117, %v17_conv_1_weight, %v17_conv_1_bias, %v17_conv_1_zero_x, %v17_conv_1_zero_y, %v17_conv_1_scale, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 4, 4), int32] */;
  %119 = nn.mcutruncate(%118) /* ty=Tensor[(1, 336, 4, 4), int8] */;
  %120 = nn.mcuconv2d(%119, %v17_conv_2_weight, %v17_conv_2_bias, %v17_conv_2_zero_x, %v17_conv_2_zero_y, %v17_conv_2_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 112, 4, 4), int32] */;
  %121 = nn.mcutruncate(%120) /* ty=Tensor[(1, 112, 4, 4), int8] */;
  %122 = mcumean(%121, axis=[2, 3], keepdims=True) /* ty=Tensor[(1, 112, 1, 1), int8] */;
  %123 = nn.mcuconv2d(%122, %v18_weight, %v18_bias, %v18_zero_x, %v18_zero_y, %v18_scale, padding=[0, 0, 0, 0]) /* ty=Tensor[(1, 10, 1, 1), int32] */;
  %124 = nn.mcutruncate(%123) /* ty=Tensor[(1, 10, 1, 1), int8] */;
  %125 = reshape(%124, newshape=[0, 0]) /* ty=Tensor[(1, 10), int8] */;
  %126 = cast(%125, dtype="float32") /* ty=Tensor[(1, 10), float32] */;
  %127 = nn.log_softmax(%126) /* ty=Tensor[(1, 10), float32] */;
  %128 = cast(%123, dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %129 = greater_equal(%128, -128f /* ty=float32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %130 = less_equal(%128, 127f /* ty=float32 */) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %131 = ones(shape=[], dtype="float32") /* ty=float32 */;
  %132 = negative(%131) /* ty=float32 */;
  %133 = multiply(%132, %label) /* ty=Tensor[(1, 10), float32] */;
  %134 = sum(%133, axis=[-1], keepdims=True) /* ty=Tensor[(1, 1), float32] */;
  %135 = exp(%127) /* ty=Tensor[(1, 10), float32] */;
  %136 = multiply(%134, %135) /* ty=Tensor[(1, 10), float32] */;
  %137 = subtract(%133, %136) /* ty=Tensor[(1, 10), float32] */;
  %138 = multiply(%129, %130) /* ty=Tensor[(1, 10, 1, 1), bool] */;
  %139 = reshape(%137, newshape=[1, 10, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %140 = zeros(shape=[1, 10, 1, 1], dtype="float32") /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %141 = where(%138, %139, %140) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %142 = reshape(%v18_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %143 = multiply(%141, %142) /* ty=Tensor[(1, 10, 1, 1), float32] */;
  %144 = cast(%122, dtype="float32") /* ty=Tensor[(1, 112, 1, 1), float32] */;
  %145 = tile(%143, reps=[1, 112, 1, 1]) /* ty=Tensor[(1, 1120, 1, 1), float32] */;
  %146 = reshape(%144, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 112, 1, 1), float32] */;
  %147 = reshape(%145, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(1120, 1, 1, 1), float32] */;
  %148 = nn.conv2d(%146, %147, padding=[0, 0, 0, 0], groups=112) /* ty=Tensor[(1, 1120, 1, 1), float32] */;
  %149 = reshape(%148, newshape=[1, 112, 10, 1, 1]) /* ty=Tensor[(1, 112, 10, 1, 1), float32] */;
  %150 = sum(%149, axis=[0]) /* ty=Tensor[(112, 10, 1, 1), float32] */;
  %151 = cast(%120, dtype="float32") /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %152 = greater_equal(%151, -128f /* ty=float32 */) /* ty=Tensor[(1, 112, 4, 4), bool] */;
  %153 = less_equal(%151, 127f /* ty=float32 */) /* ty=Tensor[(1, 112, 4, 4), bool] */;
  %154 = cast(%v18_weight, dtype="float32") /* ty=Tensor[(10, 112, 1, 1), float32] */;
  %155 = nn.conv2d_transpose(%143, %154, channels=112, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 112, 1, 1), float32] */;
  %156 = multiply(%155, 0.0625f /* ty=float32 */) /* ty=Tensor[(1, 112, 1, 1), float32] */;
  %157 = ones(shape=[1, 112, 4, 4], dtype="float32") /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %158 = multiply(%152, %153) /* ty=Tensor[(1, 112, 4, 4), bool] */;
  %159 = multiply(%156, %157) /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %160 = zeros(shape=[1, 112, 4, 4], dtype="float32") /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %161 = where(%158, %159, %160) /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %162 = reshape(%v17_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 112, 1, 1), float32] */;
  %163 = multiply(%161, %162) /* ty=Tensor[(1, 112, 4, 4), float32] */;
  %164 = cast(%119, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %165 = tile(%163, reps=[1, 336, 1, 1]) /* ty=Tensor[(1, 37632, 4, 4), float32] */;
  %166 = reshape(%164, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %167 = reshape(%165, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(37632, 1, 4, 4), float32] */;
  %168 = nn.conv2d(%166, %167, padding=[0, 0, 0, 0], groups=336) /* ty=Tensor[(1, 37632, 1, 1), float32] */;
  %169 = reshape(%168, newshape=[1, 336, 112, 1, 1]) /* ty=Tensor[(1, 336, 112, 1, 1), float32] */;
  %170 = sum(%169, axis=[0]) /* ty=Tensor[(336, 112, 1, 1), float32] */;
  %171 = cast(%118, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %172 = greater_equal(%171, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %173 = less_equal(%171, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %174 = cast(%v17_conv_2_weight, dtype="float32") /* ty=Tensor[(112, 336, 1, 1), float32] */;
  %175 = multiply(%172, %173) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %176 = nn.conv2d_transpose(%163, %174, channels=336, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %177 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %178 = where(%175, %176, %177) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %179 = reshape(%v17_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %180 = multiply(%178, %179) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %181 = cast(%117, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %182 = tile(%180, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %183 = reshape(%181, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %184 = reshape(%182, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(336, 1, 4, 4), float32] */;
  %185 = nn.conv2d(%183, %184, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %186 = reshape(%185, newshape=[1, 1, 336, 3, 3]) /* ty=Tensor[(1, 1, 336, 3, 3), float32] */;
  %187 = sum(%186, axis=[0]) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %188 = cast(%116, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %189 = greater_equal(%188, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %190 = less_equal(%188, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %191 = cast(%v17_conv_1_weight, dtype="float32") /* ty=Tensor[(336, 1, 3, 3), float32] */;
  %192 = multiply(%189, %190) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %193 = nn.conv2d_transpose(%180, %191, channels=336, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=336, kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %194 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %195 = where(%192, %193, %194) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %196 = reshape(%v17_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %197 = multiply(%195, %196) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %198 = cast(%115, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %199 = tile(%197, reps=[1, 56, 1, 1]) /* ty=Tensor[(1, 18816, 4, 4), float32] */;
  %200 = reshape(%198, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %201 = reshape(%199, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(18816, 1, 4, 4), float32] */;
  %202 = nn.conv2d(%200, %201, padding=[0, 0, 0, 0], groups=56) /* ty=Tensor[(1, 18816, 1, 1), float32] */;
  %203 = reshape(%202, newshape=[1, 56, 336, 1, 1]) /* ty=Tensor[(1, 56, 336, 1, 1), float32] */;
  %204 = sum(%203, axis=[0]) /* ty=Tensor[(56, 336, 1, 1), float32] */;
  %205 = cast(%112, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %206 = greater_equal(%205, -128f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %207 = less_equal(%205, 127f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %208 = cast(%114, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %209 = greater_equal(%208, -128f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %210 = less_equal(%208, 127f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %211 = cast(%v17_conv_0_weight, dtype="float32") /* ty=Tensor[(336, 56, 1, 1), float32] */;
  %212 = multiply(%209, %210) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %213 = nn.conv2d_transpose(%197, %211, channels=56, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %214 = zeros(shape=[1, 56, 4, 4], dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %215 = where(%212, %213, %214) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %216 = reshape(%v16_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %217 = divide(%215, %216) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %218 = reshape(%v16_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %219 = multiply(%206, %207) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %220 = multiply(%217, %218) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %221 = zeros(shape=[1, 56, 4, 4], dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %222 = where(%219, %220, %221) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %223 = reshape(%v16_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 56, 1, 1), float32] */;
  %224 = multiply(%222, %223) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %225 = cast(%111, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %226 = tile(%224, reps=[1, 336, 1, 1]) /* ty=Tensor[(1, 18816, 4, 4), float32] */;
  %227 = reshape(%225, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %228 = reshape(%226, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(18816, 1, 4, 4), float32] */;
  %229 = nn.conv2d(%227, %228, padding=[0, 0, 0, 0], groups=336) /* ty=Tensor[(1, 18816, 1, 1), float32] */;
  %230 = reshape(%229, newshape=[1, 336, 56, 1, 1]) /* ty=Tensor[(1, 336, 56, 1, 1), float32] */;
  %231 = sum(%230, axis=[0]) /* ty=Tensor[(336, 56, 1, 1), float32] */;
  %232 = cast(%110, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %233 = greater_equal(%232, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %234 = less_equal(%232, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %235 = cast(%v16_conv_2_weight, dtype="float32") /* ty=Tensor[(56, 336, 1, 1), float32] */;
  %236 = multiply(%233, %234) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %237 = nn.conv2d_transpose(%224, %235, channels=336, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %238 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %239 = where(%236, %237, %238) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %240 = reshape(%v16_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %241 = multiply(%239, %240) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %242 = cast(%109, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %243 = tile(%241, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %244 = reshape(%242, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %245 = reshape(%243, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(336, 1, 4, 4), float32] */;
  %246 = nn.conv2d(%244, %245, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %247 = reshape(%246, newshape=[1, 1, 336, 3, 3]) /* ty=Tensor[(1, 1, 336, 3, 3), float32] */;
  %248 = sum(%247, axis=[0]) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %249 = cast(%108, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %250 = greater_equal(%249, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %251 = less_equal(%249, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %252 = cast(%v16_conv_1_weight, dtype="float32") /* ty=Tensor[(336, 1, 3, 3), float32] */;
  %253 = multiply(%250, %251) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %254 = nn.conv2d_transpose(%241, %252, channels=336, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=336, kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %255 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %256 = where(%253, %254, %255) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %257 = reshape(%v16_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %258 = multiply(%256, %257) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %259 = cast(%107, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %260 = tile(%258, reps=[1, 56, 1, 1]) /* ty=Tensor[(1, 18816, 4, 4), float32] */;
  %261 = reshape(%259, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %262 = reshape(%260, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(18816, 1, 4, 4), float32] */;
  %263 = nn.conv2d(%261, %262, padding=[0, 0, 0, 0], groups=56) /* ty=Tensor[(1, 18816, 1, 1), float32] */;
  %264 = reshape(%263, newshape=[1, 56, 336, 1, 1]) /* ty=Tensor[(1, 56, 336, 1, 1), float32] */;
  %265 = sum(%264, axis=[0]) /* ty=Tensor[(56, 336, 1, 1), float32] */;
  %266 = cast(%104, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %267 = greater_equal(%266, -128f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %268 = less_equal(%266, 127f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %269 = cast(%106, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %270 = greater_equal(%269, -128f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %271 = less_equal(%269, 127f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %272 = cast(%v16_conv_0_weight, dtype="float32") /* ty=Tensor[(336, 56, 1, 1), float32] */;
  %273 = multiply(%270, %271) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %274 = nn.conv2d_transpose(%258, %272, channels=56, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %275 = zeros(shape=[1, 56, 4, 4], dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %276 = where(%273, %274, %275) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %277 = reshape(%v15_qadd_scale_y, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %278 = divide(%276, %277) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %279 = reshape(%v15_qadd_scale_x2, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 1, 1, 1), float32] */;
  %280 = multiply(%267, %268) /* ty=Tensor[(1, 56, 4, 4), bool] */;
  %281 = multiply(%278, %279) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %282 = zeros(shape=[1, 56, 4, 4], dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %283 = where(%280, %281, %282) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %284 = reshape(%v15_conv_2_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 56, 1, 1), float32] */;
  %285 = multiply(%283, %284) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %286 = cast(%103, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %287 = tile(%285, reps=[1, 336, 1, 1]) /* ty=Tensor[(1, 18816, 4, 4), float32] */;
  %288 = reshape(%286, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %289 = reshape(%287, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(18816, 1, 4, 4), float32] */;
  %290 = nn.conv2d(%288, %289, padding=[0, 0, 0, 0], groups=336) /* ty=Tensor[(1, 18816, 1, 1), float32] */;
  %291 = reshape(%290, newshape=[1, 336, 56, 1, 1]) /* ty=Tensor[(1, 336, 56, 1, 1), float32] */;
  %292 = sum(%291, axis=[0]) /* ty=Tensor[(336, 56, 1, 1), float32] */;
  %293 = cast(%102, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %294 = greater_equal(%293, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %295 = less_equal(%293, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %296 = cast(%v15_conv_2_weight, dtype="float32") /* ty=Tensor[(56, 336, 1, 1), float32] */;
  %297 = multiply(%294, %295) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %298 = nn.conv2d_transpose(%285, %296, channels=336, kernel_size=[1, 1], padding=[0, 0, 0, 0], kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %299 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %300 = where(%297, %298, %299) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %301 = reshape(%v15_conv_1_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %302 = multiply(%300, %301) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %303 = cast(%101, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %304 = tile(%302, reps=[1, 1, 1, 1]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %305 = reshape(%303, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %306 = reshape(%304, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(336, 1, 4, 4), float32] */;
  %307 = nn.conv2d(%305, %306, padding=[1, 1, 1, 1], groups=336) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %308 = reshape(%307, newshape=[1, 1, 336, 3, 3]) /* ty=Tensor[(1, 1, 336, 3, 3), float32] */;
  %309 = sum(%308, axis=[0]) /* ty=Tensor[(1, 336, 3, 3), float32] */;
  %310 = cast(%100, dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %311 = greater_equal(%310, -128f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %312 = less_equal(%310, 127f /* ty=float32 */) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %313 = cast(%v15_conv_1_weight, dtype="float32") /* ty=Tensor[(336, 1, 3, 3), float32] */;
  %314 = multiply(%311, %312) /* ty=Tensor[(1, 336, 4, 4), bool] */;
  %315 = nn.conv2d_transpose(%302, %313, channels=336, kernel_size=[3, 3], padding=[1, 1, 1, 1], groups=336, kernel_layout="IOHW") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %316 = zeros(shape=[1, 336, 4, 4], dtype="float32") /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %317 = where(%314, %315, %316) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %318 = reshape(%v15_conv_0_scale, newshape=[1, -1, 1, 1]) /* ty=Tensor[(1, 336, 1, 1), float32] */;
  %319 = multiply(%317, %318) /* ty=Tensor[(1, 336, 4, 4), float32] */;
  %320 = cast(%99, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %321 = tile(%319, reps=[1, 56, 1, 1]) /* ty=Tensor[(1, 18816, 4, 4), float32] */;
  %322 = reshape(%320, newshape=[1, -1, 0, 0]) /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %323 = reshape(%321, newshape=[-1, 1, 0, 0]) /* ty=Tensor[(18816, 1, 4, 4), float32] */;
  %324 = nn.conv2d(%322, %323, padding=[0, 0, 0, 0], groups=56) /* ty=Tensor[(1, 18816, 1, 1), float32] */;
  %325 = reshape(%324, newshape=[1, 56, 336, 1, 1]) /* ty=Tensor[(1, 56, 336, 1, 1), float32] */;
  %326 = sum(%325, axis=[0]) /* ty=Tensor[(56, 336, 1, 1), float32] */;
  %327 = cast(%98, dtype="float32") /* ty=Tensor[(1, 56, 4, 4), float32] */;
  %328 = greater_equal(%327, -128f /* ty=float32 */) /* ty=Tensor[(1, 56, 4, 4), bool] */;
